Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: So, with the reactive execution model, the requests are processed using I/O threads. But that's not all. An I/O thread can handle multiple concurrent requests. How? Here is the trick and one of the most significant differences between reactive and imperative.
ja_jp: つまり、リアクティブな実行モデルでは、I/Oスレッドを使ってリクエストを処理します。しかし、それだけではありません。I/Oスレッドは、複数の同時リクエストを処理することができます。どうやって？これが、リアクティブとインペラティブの最も重要な違いの一つであるトリックです。

source: So, yes, it appears it works out of the box and this guide is pretty useless.
ja_jp: はい、修正不要で動作し、このガイドはかなり役立たずであるように見えますね。

source: So, you can extend the `PagingAndSortingRepository`:
ja_jp: そのため、 `PagingAndSortingRepository` を拡張することが出来ます:

source: So, you should have the following files in your project:
ja_jp: そこで、プロジェクト内に以下のファイルを用意しておきます。

source: SockJS negotiates the communication channel between the Quarkus application and the browser. If WebSockets are supported, it uses them; otherwise, it degrades to SSE, long polling, etc.
ja_jp: SockJSは、Quarkusアプリケーションとブラウザの間の通信チャネルをネゴシエートします。WebSocketがサポートされている場合はそれを使用し、そうでない場合はSSEや長いポーリングなどにダウングレードします。

source: Socket log handler
ja_jp: Socket ログハンドラー

source: Soft constraints should not be broken. For example: _A teacher prefers to teach in a single room._
ja_jp: ソフト制約を破ってはいけません。例: _教師は 1 つの教室で教えることを好みます。_

source: Software Transactional Memory (STM) has been around in research environments since the late 1990's and has relatively recently started to appear in products and various programming languages. We won't go into all of the details behind STM but the interested reader could look at https://groups.csail.mit.edu/tds/papers/Shavit/ShavitTouitou-podc95.pdf[this paper]. However, suffice it to say that STM offers an approach to developing transactional applications in a highly concurrent environment with some of the same characteristics of ACID transactions, which you've probably already used through JTA. Importantly though, the Durability property is relaxed (removed) within STM implementations, or at least made optional. This is not the situation with JTA, where state changes are made durable to a relational database which supports https://pubs.opengroup.org/onlinepubs/009680699/toc.pdf[the X/Open XA standard].
ja_jp: ソフトウェア・トランザクション・メモリー(STM)は、1990 年代後半から研究環境に存在し、比較的最近になって製品や様々なプログラミング言語に登場し始めました。STM の背後にあるすべての詳細については触れませんが,興味のある方は link:https://groups.csail.mit.edu/tds/papers/Shavit/ShavitTouitou-podc95.pdf[この論文] を参照してください.しかし、STM は、JTA を通じて既に使用されている ACID トランザクションと同じ特性を持つ、高度な同時実行環境でトランザクショ ン・アプリケーションを開発するためのアプローチを提供していることは言うまでもありません。しかし、重要なことは、STM の実装では Durability プロパティーが緩和(削除)されているか、少なくともオプションになっていることです。これは、 link:https://pubs.opengroup.org/onlinepubs/009680699/toc.pdf[X/Open XA 標準] をサポートするリレーショナル・データベースに対して状態の変更を耐久性のあるものにするという JTA の状況とは異なります。

source: Software Transactional Memory (STM) has been around in research environments since the late 1990's and has relatively recently started to appear in products and various programming languages. We won't go into all the details behind STM but the interested reader could look at https://groups.csail.mit.edu/tds/papers/Shavit/ShavitTouitou-podc95.pdf[this paper]. However, suffice it to say that STM offers an approach to developing transactional applications in a highly concurrent environment with some of the same characteristics of ACID transactions, which you've probably already used through JTA. Importantly though, the Durability property is relaxed (removed) within STM implementations, or at least made optional. This is not the situation with JTA, where state changes are made durable to a relational database which supports https://pubs.opengroup.org/onlinepubs/009680699/toc.pdf[the X/Open XA standard].
ja_jp: ソフトウェアトランザクショナルメモリー (STM) は、1990 年代後半から研究されており、最近になって製品やさまざまなプログラミング言語に登場し始めました。STM の背後にあるすべての詳細については触れませんが、興味のある方は https://groups.csail.mit.edu/tds/papers/Shavit/ShavitTouitou-podc95.pdf[この論文] を参照してください。ただし、STM は、おそらく JTA を通じて既に使用したことがあるACID トランザクションと同じ特性をいくつか備えた高度な並行環境でトランザクション アプリケーションを開発するためのアプローチを提供する、とだけ言っておけば十分でしょう。重要なのは、STM の実装では、Durability プロパティーが緩和 （削除） されているか、少なくともオプションになっていることです。これは、link:https://pubs.opengroup.org/onlinepubs/009680699/toc.pdf[X/Open XA 標準] をサポートするリレーショナルデータベースに対して状態の変更を耐久性のあるものにするという JTA の状況とは異なります。

source: Software Transactional Memory (stm) support
ja_jp: ソフトウェアトランザクショナルメモリー (STM) サポート

source: Solution
ja_jp: ソリューション

source: Solution 1: using the active record pattern
ja_jp: 解決策1:アクティブレコードパターンを使用する

source: Solution 2: using the repository pattern
ja_jp: 解決策2:リポジトリパターンを使用する

source: Solving problems with Quarkus extensions (1/n)
ja_jp: Quarkusのエクステンションで問題を解く (1/n)

source: Solving problems with custom Quarkus extensions
ja_jp: Quarkusのカスタムエクステンションに関する問題の解決

source: Solving this issue requires adding the `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` option and to provide a dynamic proxy configuration file.
ja_jp: この問題を解決するには、 `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` オプションを追加し、動的プロキシ設定ファイルを提供する必要があります。

source: Solving this issue requires adding the `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` option and to provide a dynamic proxy configuration file. You can find all the information about the format of this file in https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md#manual-configuration[the GraalVM documentation].
ja_jp: この問題を解決するには、 `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` オプションを追加し、ダイナミックプロキシ設定ファイルを用意する必要があります。このファイルのフォーマットに関するすべての情報は、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md#manual-configuration[GraalVMのドキュメント]に記載されています。

source: Solving this issue requires adding the `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` option and to provide a dynamic proxy configuration file. You can find all the information about the format of this file in https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[the GraalVM documentation].
ja_jp: この問題を解決するには、 `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` オプションを追加し、ダイナミックプロキシ設定ファイルを用意する必要があります。このファイルのフォーマットに関するすべての情報は、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM ドキュメント] に記載されています。

source: Some CDI events are fired synchronously and asynchronously when specific events occur.
ja_jp: 一部の CDI イベントは、特定のイベントが発生したときに同期的または非同期的に起動されます。

source: Some Dev Services implement sophisticated reuse logic in which they track the state of the container in the processor itself. You may need this if your service has more complex requirements, or needs sharing across instances.
ja_jp: 一部の Dev Service は、プロセッサー自体のコンテナーの状態を追跡する高度な再利用ロジックを実装しています。 サービスに複雑な要件がある場合や、インスタンス間で共有する必要がある場合は、これが必要になることがあります。

source: Some HTTP authentication mechanisms must handle authentication exceptions themselves to create a correct authentication challenge. For example, `io.quarkus.oidc.runtime.CodeAuthenticationMechanism`, which manages OpenID Connect (OIDC) authorization code flow authentication, must build a correct redirect URL and set a state cookie. Therefore, avoid using custom exception mappers to customize authentication exceptions thrown by such mechanisms. Instead, a safer approach is to ensure that proactive authentication is enabled and to use Vert.x HTTP route failure handlers. This is because events come to the handler with the correct response status and headers. Then, you must only customize the response; for example:
ja_jp: 一部の HTTP 認証メカニズムでは、正しい認証チャレンジを作成するために、認証例外を自ら処理する必要があります。 たとえば、OpenID Connect (OIDC) 認可コードフロー認証を管理する `io.quarkus.oidc.runtime.CodeAuthenticationMechanism` は、正しいリダイレクト URL を構築し、状態 Cookie を設定する必要があります。 したがって、このようなメカニズムによって出力される認証例外をカスタマイズするためにカスタム例外マッパーを使用することは避けてください。 代わりに、より安全なアプローチとしては、プロアクティブ認証が有効になっていることを確認し、Vert.x HTTP ルート失敗ハンドラーを使用してください。 これは、イベントが正しい応答ステータスとヘッダーとともにハンドラーに送信されるためです。 次に、応答のみをカスタマイズする必要があります。例:

source: Some HTTP authentication mechanisms need to handle authentication exceptions themselves in order to create a correct authentication challenge. For example, `io.quarkus.oidc.runtime.CodeAuthenticationMechanism` which manages OpenId Connect authorization code flow authentication, needs to build a correct redirect URL, cookies, etc. For that reason, using custom exception mappers to customize authentication exceptions thrown by such mechanisms is not recommended. In such cases, a safer way to customize authentication exceptions is to make sure the proactive authentication is not disabled and use Vert.x HTTP route failure handlers, as events come to the handler with the correct response status and headers. To that end, the only thing that needs to be done is to customize the response like this:
ja_jp: HTTP認証メカニズムの中には、正しい認証チャレンジを作成するために、認証例外を自ら処理する必要があるものがあります。例えば、OpenId Connectの認可コードフロー認証を管理する `io.quarkus.oidc.runtime.CodeAuthenticationMechanism` は、正しいリダイレクトURLやcookieなどを構築する必要があります。そのため、このようなメカニズムが投げる認証例外をカスタム例外マッパーでカスタマイズすることは推奨されません。このような場合、認証例外をカスタマイズする安全な方法は、プロアクティブ認証が無効になっていないことを確認し、イベントが正しい応答ステータスとヘッダーでハンドラに来るように、Vert.x HTTPルート障害ハンドラを使用することです。そのために必要なことは、応答をこのようにカスタマイズすることです:

source: Some Microsoft services may issue tokens whose signatures can only be verified if the current token's `nonce` header is reset with its SHA-256 digest value. If your application has to deal with such tokens then please enable an Azure token customizer:
ja_jp: 一部の Microsoft サービスでは、現在のトークンの `nonce` ヘッダーが SHA-256 ダイジェスト値でリセットされた場合にのみ署名を検証できるトークンが発行される場合があります。 アプリケーションでこのようなトークンを処理する必要がある場合は、Azure トークンカスタマイザーを有効にしてください。

source: Some Mutiny operators need to schedule work on an executor thread pool. A good example is `.onItem().delayIt().by(Duration.ofMillis(10))` as it needs such an executor to delay emissions.
ja_jp: 一部の Mutiny オペレーターは、エグゼキュータースレッドプールで処理をスケジュールする必要があります。 良い例は `.onItem().delayIt().by(Duration.ofMillis(10))` です。これは、発行を遅延させるようなエグゼキューターが必要なためです。

source: Some Mutiny operators need to schedule work on an executor thread pool. A good example is `.onItem().delayIt().by(Duration.ofMillis(10)` as it needs such an executor to delay emissions.
ja_jp: Mutiny オペレータの中には、エクゼキュータ・スレッドプール上で作業をスケジュー ルする必要があるものがあります。 その良い例が `.onItem().delayIt().by(Duration.ofMillis(10)` で、排出を遅らせるためにそのようなエクゼキュータを必要とします。

source: Some OIDC providers do not support a link:https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated logout] specification and do not return an OpenID Connect well-known `end_session_endpoint` metadata property. However, this is not a problem for Quarkus because the specific logout mechanisms of such OIDC providers only differ in how the logout URL query parameters are named.
ja_jp: 一部の OIDC プロバイダーは、link:https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated ログアウト] 仕様をサポートしておらず、OpenID Connect の周知の（well-knownの） `end_session_endpoint` メタデータプロパティーを返しません。 ただし、このような OIDC プロバイダーの特定のログアウトメカニズムは、ログアウト URL クエリーパラメーターの命名方法のみが異なるため、Quarkus にとってはこれは問題ではありません。

source: Some OIDC providers do not support a link:https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated logout] specification and do not return an OpenID Connect well-known `end_session_endpoint` metadata property. However, this is not a problem for Quarkus, as the logout mechanisms of such OIDC providers differ only in the naming of the logout URL query parameters.
ja_jp: 一部の OIDC プロバイダーは、link:https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP 開始ログアウト] 仕様をサポートしておらず、OpenID Connect の周知の `end_session_endpoint` メタデータプロパティーを返しません。 ただし、このような OIDC プロバイダーのログアウトメカニズムは、ログアウト URL クエリーパラメーターの命名方法のみが異なるため、Quarkus にとってはこれは問題ではありません。

source: Some OIDC providers might require that a client be authenticated as part of the mutual TLS authentication process.
ja_jp: 一部の OIDC プロバイダーでは、相互 TLS 認証プロセスの一部としてクライアントが認証されることを要求する場合があります。

source: Some OIDC providers might require that a client is authenticated as part of the mutual TLS authentication process.
ja_jp: OIDCプロバイダによっては、相互TLS認証プロセスの一部としてクライアントの認証を要求する場合があります。

source: Some OIDC providers require authentication to its introspection endpoint by using Basic authentication and with credentials that are different from the `client_id` and `client_secret`. If you have previously configured security authentication to support either the `client_secret_basic` or `client_secret_post` client authentication methods as described in the <<oidc-provider-client-authentication,OIDC provider client authentication>> section, you might need to apply the additional configuration as follows.
ja_jp: OIDC プロバイダの中には、 `client_id` および `client_secret` とは異なる認証情報を使用して、Basic 認証を使用してイントロスペクション・エンドポイントへの認証を必要とするものがあります。 xref:oidc-provider-client-authentication[OIDC プロバイダのクライアント認証] のセクションで説明したように、 `client_secret_basic` または `client_secret_post` のクライアント認証方法のいずれかをサポートするようにセキュリティ認証を以前に構成している場合は、以下のように追加の設定を適用する必要がある場合があります。

source: Some OIDC providers require authentication to their introspection endpoint by using Basic authentication with credentials that differ from the `client_id` and `client_secret`. If you have previously configured security authentication to support either the `client_secret_basic` or `client_secret_post` client authentication methods as described in the <<oidc-provider-client-authentication,OIDC provider client authentication>> section, you might need to apply the additional configuration as follows.
ja_jp: 一部の OIDC プロバイダーでは、Basic 認証と `client_id` および `client_secret` とは異なるクレデンシャルを使用して、イントロスペクションエンドポイントへの認証を行う必要があります。 <<oidc-provider-client-authentication,OIDC プロバイダークライアント認証>> セクションで説明されているように、以前にセキュリティー認証を設定して、 `client_secret_basic` または `client_secret_post` クライアント認証メソッドをサポートしていた場合は、次のように追加の設定を適用することをお勧めします。

source: Some OIDC providers require the `redirect_uri` to have the same value for a given application across all redirect URLs, for example, `http://localhost:8080/service/callback`.
ja_jp: 一部の OIDC プロバイダーでは、すべてのリダイレクト URL の特定のアプリケーションに対して、 `redirect_uri` が同じ値 (例: `http://localhost:8080/service/callback`) を持つことが必要です。

source: Some OIDC providers require the `redirect_uri` to have the same value for a given application, for example, `http://localhost:8080/service/callback`, for all the redirect URLs. In such cases, a `quarkus.oidc.authentication.redirect-path` property has to be set. For example, `quarkus.oidc.authentication.redirect-path=/service/callback`, and Quarkus will set the `redirect_uri` parameter to an absolute URL such as `http://localhost:8080/service/callback`, which will be the same regardless of the current request URL.
ja_jp: 一部の OIDC プロバイダーでは、すべてのリダイレクト URL の特定のアプリケーションに対して、 `redirect_uri` が同じ値 (例: `http://localhost:8080/service/callback`) を持つことが必要です。 このような場合は、 `quarkus.oidc.authentication.redirect-path` プロパティーを設定する必要があります。 たとえば、 `quarkus.oidc.authentication.redirect-path=/service/callback` の場合、Quarkus は `redirect_uri` パラメーターを `http://localhost:8080/service/callback` などの絶対 URL に設定します。これは、現在のリクエスト URL に関係なく同じになります。

source: Some OIDC providers support metadata discovery but do not return all the endpoint URL values required for the authorization code flow to complete or to support application functions, for example, user logout. To work around this limitation, you can configure the missing endpoint URL values locally, as outlined in the following example:
ja_jp: 一部の OIDC プロバイダは、メタデータディスカバリーをサポートしていますが、認可コードフローを完了したり、ユーザーログアウトなどのアプリケーション機能をサポートしたりするために必要なすべてのエンドポイント URL 値は返しません。 この制限を回避するには、次の例に示すように、不足しているエンドポイント URL 値をローカルで設定します：

source: Some OIDC providers support metadata discovery but do not return all the endpoint URLs required for the authorization code flow to complete or to support application functions, such as user logout. To work around this limitation, you can configure the missing endpoint URL values locally, as outlined in the following example:
ja_jp: 一部の OIDC プロバイダーはメタデータディスカバリーをサポートしていますが、認可コードフローを完了したり、ユーザーログアウトなどのアプリケーション機能をサポートしたりするために必要なすべてのエンドポイント URL が返されない場合があります。 この制限を回避するには、次の例に示すように、不足しているエンドポイント URL の値をローカルで設定します。

source: Some OIDC providers support remote token introspecion endpoints and Quarkus fallbacks to introspecting JWT tokens if it can not find a matching JWK verification key even after refreshing the key set. However, just because the provider supports the introspection endpoint, your deployment policy may forbid the remote JWT token introspection: because the token may have sensitive claims, or for performance reasons, especially if you know that, for example, ID tokens can not be introspected remotely, but only verified locally with the JWK keys. Set `quarkus.oidc.token.allow-jwt-introspection=false` if you do not want JWT tokens sent for the remote introspection.
ja_jp: 一部の OIDC プロバイダーはリモートトークンイントロスペクションエンドポイントをサポートしており、Quarkus はキーセットを更新した後でも一致する JWK 検証キーが見つからない場合、JWT トークンのイントロスペクションにフォールバックします。しかし、プロバイダーがイントロスペクションエンドポイントをサポートしているからといって、デプロイメントポリシーでリモート JWT トークンイントロスペクションが禁止されている場合があります。トークンに機密性の高いクレームが含まれている可能性や、パフォーマンス上の理由があるためです。特に、たとえば ID トークンはリモートでイントロスペクションできず、JWK キーでローカルに検証するしかないことが分かっている場合はそうでしょう。リモートイントロスペクションに JWT トークンを送信したくない場合は、`quarkus.oidc.token.allow-jwt-introspection=false` を設定してください。

source: Some OpenID Connect Providers may require authenticating to its introspection endpoint using Basic Authentication with the credentials different to `client_id` and `client_secret` which may have already been configured to support `client_secret_basic` or `client_secret_post` client authentication methods described in the <<oidc-provider-client-authentication, Oidc Provider Client Authentication>> section.
ja_jp: OpenID Connect プロバイダーによってはイントロスペクションエンドポイントに対して、<<oidc-provider-client-authentication, Oidc プロバイダークライアント認証>> セクションで説明した `client_secret_basic` または `client_secret_post` クライアント認証方式をサポートするように設定済みの `client_id` と `client_secret` とは異なる認証情報での基本認証による認証が要求される場合があります。

source: Some OpenID Connect Providers may require that a client is authenticated as part of the `Mutual TLS` (`MTLS`) authentication process.
ja_jp: OpenID Connect プロバイダによっては、 `Mutual TLS` ( `MTLS` ) 認証プロセスの一部として、クライアントの認証を要求する場合があります。

source: Some OpenID Connect Providers may require that a client is authenticated as part of the `Mutual TLS` (`mTLS`) authentication process.
ja_jp: OpenID Connect プロバイダーによっては、クライアントが `Mutual TLS` (`mTLS`) 認証プロセスの一部として認証されることを要求する場合があります。

source: Some OpenID Connect Providers require that a client is authenticated as part of the mutual TLS (`mTLS`) authentication process.
ja_jp: 一部の OpenID Connect プロバイダーでは、相互 TLS (`mTLS`) 認証プロセスの一部としてクライアントを認証する必要がある場合があります。

source: Some OpenID Connect Providers will not return a refresh token in a `client_credentials` grant response. For example, starting from Keycloak 12, a refresh token will not be returned by default for `client_credentials`. The providers might also restrict the number of times a refresh token can be used.
ja_jp: OpenID Connect プロバイダーによっては、 `client_credentials` グラントレスポンスでリフレッシュトークンを返さないものがあることに注意してください。たとえば、Keycloak 12 以降では、 `client_credentials` に対してデフォルトでリフレッシュトークンが返されません。また、プロバイダーはリフレッシュトークンの使用回数を制限している場合があります。

source: Some OpenID Connect providers do not return a refresh token in a `client_credentials` grant response. For example, starting with Keycloak 12, a refresh token is not returned by default for `client_credentials`. Providers might also restrict how many times a refresh token can be used.
ja_jp: 一部の OpenID Connect プロバイダーは、 `client_credentials` グラント応答でリフレッシュトークンを返しません。たとえば、Keycloak 12 以降、`client_credentials` に対してはデフォルトでリフレッシュトークンが返されません。また、プロバイダーはリフレッシュトークンの使用回数を制限している場合があります。

source: Some OpenID Connect providers require that a client be authenticated as part of the mutual TLS (`mTLS`) authentication process.
ja_jp: 一部の OpenID Connect プロバイダーでは、相互 TLS (`mTLS`) 認証プロセスの一部としてクライアントを認証する必要があります。

source: Some Quarkus Messaging connectors integrate out-of-the-box with OpenTelemetry Tracing. When the xref:opentelemetry.adoc[OpenTelemetry extension] is present, outgoing messages propagate the current tracing span. On incoming channels, if a received message contains tracing information, the message processing inherits the message span as parent.
ja_jp: 一部の Quarkus Messaging コネクターは、OpenTelemetry Tracing とすぐに統合されます。 xref:opentelemetry.adoc[OpenTelemetry エクステンション] が存在する場合、発信メッセージは現在のトレース範囲を伝播します。 着信チャネルでは、受信したメッセージにトレース情報が含まれている場合、メッセージ処理はメッセージスパンを親として継承します。

source: Some Quarkus configuration options will be used constantly throughout this debugging guide, so to help declutter command line invocations, it's recommended to add these options to the `application.properties` file. So, go ahead and add the following options to that file:
ja_jp: Quarkusの設定オプションの中には、このデバッグガイドの中で常に使用されるものがあります。そのため、コマンドラインからの呼び出しを減らすために、これらのオプションを `application.properties` ファイルに追加することをお勧めします。そこで、次のオプションをそのファイルに追加してください：

source: Some Quarkus configuration options will be used constantly throughout this guide, so to help declutter command line invocations, it's recommended to add these options to the `application.properties` file. So, go ahead and add the following options to that file:
ja_jp: 一部の Quarkus 設定オプションは、このガイド全体で常に使用されるため、コマンドラインの呼び出しを整理しやすくするために、これらのオプションを `application.properties` ファイルに追加することをお勧めします。では、さっそく以下のオプションをこのファイルに追加してください。

source: Some Quarkus configurations only take effect during build time (compile), meaning it is not possible to change it at runtime. These configurations are still available at runtime but as read-only and have no effect in Quarkus behaviour. A change to any of these configurations requires a rebuild of the application itself to reflect changes of such properties. This allows Quarkus to provide optimizations and reduce complexity based on the current build configuration. By default, Quarkus uses the `prod` configuration profile to build the application.
ja_jp: 一部の Quarkus 設定はビルド時 (コンパイル時) にのみ有効になり、実行時に変更することはできません。これらの設定は実行時にも読み取り専用として利用可能ですが、 Quarkus の動作には影響しません。これらの設定を変更した場合は、プロパティーの変更を反映させるためにアプリケーション自体の再ビルドが必要です。これにより、 Quarkus は現在のビルド設定に基づいて最適化を提供し、複雑さを軽減することができます。デフォルトでは、 Quarkus は `prod` 設定プロファイルを使用してアプリケーションをビルドします。

source: Some Quarkus configurations only take effect during build time, meaning is not possible to change them at runtime. These configurations are still available at runtime but as read-only and have no effect in Quarkus behaviour. A change to any of these configurations requires a rebuild of the application itself to reflect changes of such properties.
ja_jp: Quarkusの設定の中には、ビルド時にのみ有効になるものがあり、ランタイムに変更することはできません。これらの設定はランタイムでも利用可能ですが、読み取り専用であり、Quarkusの動作には影響しません。これらの設定を変更するには、そのようなプロパティの変更を反映させる場合、アプリケーション自体を再ビルドする必要があります。

source: Some Quarkus configurations only take effect during build time, meaning it is not possible to change them at runtime. These configurations are still available at runtime but as read-only and have no effect in Quarkus behaviour. A change to any of these configurations requires a rebuild of the application itself to reflect changes of such properties.
ja_jp: Quarkus の設定の中には、ビルド時にのみ有効になるものがあり、ランタイムに変更することはできません。これらの設定はランタイムでも利用可能ですが、読み取り専用であり、Quarkus の動作には影響しません。これらの設定を変更してプロパティーの変更を反映させるには、アプリケーション自体を再ビルドする必要があります。

source: Some Quarkus extensions already integrate with the Proxy Registry, including:
ja_jp: Quarkus プロキシーレジストリーとすでに統合されている Quarkus エクステンションには、以下が含まれます。

source: Some Quarkus extensions will require additional code to ensure traces are propagated to subsequent execution. These sections will outline what is necessary to propagate traces across process boundaries.
ja_jp: Quarkus エクステンションの中には、トレースが後続の実行に伝搬されることを保証するために追加のコードを必要とするものがあります。 これらのセクションでは、プロセスの境界を越えてトレースを伝搬するために必要なことを説明します。

source: Some REST Client interface methods may have a `@Consumes` annotation with multiple media type values, for example:
ja_jp: REST Client インターフェイスのメソッドには、複数のメディアタイプ値を持つ `@Consumes` アノテーションが付与されている場合があります。次に例を示します。
